# Реализовать алгоритм задания случайных чисел.(Без использования библиотеки random)

# первое решение
import time

print(int(float(time.time())%10))

# второе решение
# from time import time

# print(int(float(time())%100))